package top.estech.core.lang;

import java.util.regex.Pattern;

/**
 * 常用正则表达式。
 *
 * @author taoml
 * @date 2019-08-08
 */
public interface PatternPool {
    /**
     * IPV4。
     */
    Pattern IPV4 = Pattern.compile("\\b((?!\\d\\d\\d)\\d+|1\\d\\d|2[0-4]\\d|25[0-5])\\.((?!\\d\\d\\d)\\d+|1\\d\\d|2[0-4]\\d|25[0-5])\\.((?!\\d\\d\\d)\\d+|1\\d\\d|2[0-4]\\d|25[0-5])\\.((?!\\d\\d\\d)\\d+|1\\d\\d|2[0-4]\\d|25[0-5])\\b");
    /**
     * 内网IP。
     * <p>
     * 内网IP段：
     * 10.0.0.0-10.255.255.255
     * 172.16.0.0-172.31.255.255
     * 192.168.0.0-192.168.255.255
     */
    Pattern INTERNAL_IP = Pattern.compile("^(192\\.168|172\\.(1[6-9]|2\\d|3[0,1]))(\\.(2[0-4]\\d|25[0-5]|[0,1]?\\d?\\d)){2}$|^10(\\.([2][0-4]\\d|25[0-5]|[0,1]?\\d?\\d)){3}$");
    /**
     * 数字，允许：负数、小数点
     *
     * 有效数字: 1  1.1  -1  -1.1
     * 无效数字: .1  1.  -1.  -1-  -1中
     *
     */
    Pattern NUMBER = Pattern.compile("-[0-9]+(.[0-9]+)?|[0-9]+(.[0-9]+)?");
}
